<template>
  	<section class="pro_tab">
      	<div class="tab">
      		<a href="javascript:;" :class="active?'active':''" @click="showDetail=true;active=true">商品详情</a>
      		<a href="javascript:;" :class="active?'':'active'" @click="showDetail=false;active=false">购物说明</a>
      	</div>
      	<div v-show="showDetail" class="detail" v-html="proInfo.description">
      	</div>
      	<div v-show="!showDetail" class="notes" v-html="shopNotes">
      	</div>
    </section>
</template>
<style lang="css" scoped>
	@import './pro_tab.css'
</style>
<script>
export default {
	name:'pro_tab',
	props:{
		proInfo:{
		    type:Object,
	        default(){
	        	return {};
	        }
	    }
	},
    data () {
	    return {
	      	showDetail:true,
			active:true,
	      	shopNotes:'<div class="productIntroduceContent show"><div class="productIntroduceDetail"><h2>一、实物配送</h2> <p>1、在您签收包裹前，请先核对包裹上的订单编号并请先检查以下内容：包裹上的客户姓名是否是您本人、包裹外包装是否有明显挤压变形、破损状况。若发现异常，在未拆开包裹的前提下，请您及时联系飞牛网客服人员，并拒收整个包裹。</p> <p>2、注意事项：若快递员以任何理由拒绝让您验收商品，为了维护您的权益，建议您先不要拆开包裹，并立即与客服人员联系， 飞牛客服热线：400-920-6565、拍拍贷客服热线：400-184-8888。</p> <p>温馨提示：大家电、3C类商品不支持开箱验货，请您谅解。</p></div> <div class="productIntroduceDetail"><h2>二、售前服务</h2> <p>1、收到商品前，相关的任何疑问，请拨打拍拍贷免费客服热线：400-184-8888</p></div> <div class="productIntroduceDetail"><h2>三、售后服务</h2> <p>1、凡“分期商城”购买的商品，若无质量问题建议避免退货。</p> <p>2、若飞牛网提供的商品若发生质量问题可咨询飞牛网，飞牛网免费客服热线：400-920-6565， 拍拍贷将协助您维权。非飞牛网提供的商品若发生质量问题可咨询拍拍贷，拍拍贷免费客服热线：400-184-8888。</p> <p>3、签收商品后7天内，如因质量问题可提交退货申请，15天内可提交换货申请。若飞牛网提供的商品，用户提交申请且审核通过，在飞牛自营商品，飞牛提供免费上门取件服务。转单商品需客户自行寄回厂商。法定节假日、停电、天气等不可抗力情况除外。非飞牛网提供的商品，拍拍贷将协助退货申请，请直接联系拍拍贷客服热线。</p> <p>温馨提示：目前不支持跨省上门取件，请您谅解！</p> <p>4、您于拍拍贷的“分期商城”所订购的商品，可按国家三包法和供货厂商售后政策享受保修、更换、维修服务。</p> <h3>温馨提示：</h3> <p>1）对于存储类商品，飞牛不提供数据导出服务，请务必在返修前将商品内的数据自行导出，否则若有数据遗失、损坏等飞牛不承担相应责任。</p> <p>2）如您当地无厂家售后检测、维修中心的，飞牛可代您将商品送往厂家进行检测、维修，周期为：售后收到商品后代检15-30天 （不含物流时间）。</p> <p>3）飞牛代为送检测的商品如检测无故障会将原物返还给您，同时，我们会提供检测无故障单。但部分厂家品牌商品无法提供无故障单，请您谅解。</p></div> <div class="productIntroduceDetail"><h2>四、退货说明</h2> <p>1、商城的货物优先采购于飞牛网，若遇到商品供货不足时，会由其他合作伙伴安排提供。其所订购的商品（商品主页已说明不支持7天无理由退货者除外），自您签收商品隔日起算七日内，如需退货请直接拨打拍拍贷免费客服热线：400-184-8888，提交退货申请。</p> <p>2、如您所购产品出现国家三包法所规范的性能故障，经由厂商指定或特约维修点确认并开具检修单，自商品签收后隔日起您可选择：7日内退货、换货或保修；第8日至第15日内，可以选择换货或者保修； 第16日至保修期内，您可以享受厂商保修服务(在不违反国家《三包》法规的前提下，飞牛网对商品退换原则保留解释权)。飞牛网免费客服热线：400-920-6565。</p> <p>3、我们将于2个工作日内进行“退货申请”的审核，审核通过将会有工作人员通知您，并于2-3个工作天内安排物流人员前往取回商品，退回商品的物流费用由飞牛网支付，同时商品必须保持全新状态且完整包装（包含：主商品、附件、包装、外盒、赠品、保修凭证、单据...等)</p></div> <div class="productIntroduceDetail"><h2>五、退款说明</h2> <p>1. 若您购买的家电商品已经拆封过，需要退换货，需请联系原厂开具鉴定检测单</p> <p>2. 签收商品隔日起七日内提交退货申请，2-3天快递员与您联系安排取回商品</p></div></div>'
	    }
    }
}
</script>